#+STARTUP: content indent

* Install

- [[https://qiita.com/seibe/items/36cef7df85fe2cefa3ea][Ubuntu に最新の Node.js を難なくインストールする]]

- apt で nodejs, npm をいれて
#+begin_src shell
sudo apt install -y nodejs npm
sudo npm install n -g
#+end_src

- n から最新安定版の nodejs を導入
#+begin_src shell
sudo n stable
#+end_src

- apt で導入した nodejs, npm は削除して shell 再起動
#+begin_src shell
sudo apt purge -y nodejs npm
exec $SHELL -l
#+end_src

- バージョンの確認
#+begin_src shell
node -v
#+end_src

#+RESULTS:
: v10.16.0

* yarn をインストール

- yarn は npm と同様 nodejs のパッケージマネージャー
- [[https://yarnpkg.com/lang/en/docs/install/#debian-stable][公式サイトのインストール手順]]

#+begin_src shell
curl -sS https://dl.yarnpkg.com/debian/pubkey.gpg | sudo apt-key add -
echo "deb https://dl.yarnpkg.com/debian/ stable main" | sudo tee /etc/apt/sources.list.d
sudo apt update
sudo apt install yarn
#+end_src

#+begin_src shell
yarn --version
#+end_src

#+RESULTS:
: 1.19.1
